//------------------------------------------------------------------------------------------------------------

// Завдання 1

/*
    Дано початковий масив "arr", що містить числа.
  
    Створіть новий масив "newArr", який містить елементи початкового масиву, помножені на 2

    Результат:
    console.log(newArr); // [2, 4, 6, 8, 10, 12, 14, 16, 18, 20]
*/

// let arr = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];

// let newArr = [];
// console.log(newArr);

// for (let index = 0; index < arr.length; index++){
//     const item = arr[index];

//     newArr[index] = item * 2;
// }

// console.log(newArr);
//------------------------------------------------------------------------------------------------------------

// Завдання 2

/*
    Створіть порожній масив "arr"

    Використовуючи методи масивів, додайте в масив значення в діапазоні від 1 до 10
    Виведіть у консоль отриманий масив
*/

// let arr = [];

// for (let index = 1; index <= 10; index++) {
//     arr.push(index);
// }

// console.log(arr);


//------------------------------------------------------------------------------------------------------------

// Завдання 3

/*
    Створіть порожній масив "arr"

    Використовуючи методи масивів, додайте в масив парні значення в діапазоні від 1 до 10
    Виведіть у консоль отриманий масив
*/

// let arr = [];

// for (let i = 1; i <= 10; i++) {
//     if (i % 2 === 0) {
//         arr.push(i);
//     }
// }

// console.log(arr);




//------------------------------------------------------------------------------------------------------------

// Завдання 4

/*
    Створіть порожній масив "arr"

    Використовуючи методи масивів, додайте в масив НЕпарні значення в діапазоні від 1 до 10
    Виведіть у консоль отриманий масив
*/

// let arr = [];

// for (let i = 1; i <= 10; i++) {
//     if (i % 2 !== 0) {
//         arr.push(i);
//     }
// }

// console.log(arr);

//------------------------------------------------------------------------------------------------------------

// Завдання 5

/*
    Дано початковий масив "arr", що містить числа.

    Створіть новий масив "newArr", який містить парні елементи початкового масиву
*/

// let arr = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];
// console.log(arr)

// let newArr = arr.filter(num => num % 2 === 0);

// console.log(newArr);





//------------------------------------------------------------------------------------------------------------

// Завдання 5

/*
    Дано початковий масив "arr", що містить числа.
  
    Створіть новий масив "newArr", який містить НЕпарні елементи початкового масиву
*/

// let arr = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];
// console.log(arr)

// let newArr = arr.filter(num => num % 2 !== 0);

// console.log(newArr);

//------------------------------------------------------------------------------------------------------------

// Завдання 6

/*
    Дано початковий масив "arr", що містить числа.
  
    Створіть новий масив "newArr", який містить елементи початкового масиву, кратні 3 (ділення на 3 без остачі)
*/

// let arr = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];
// console.log(arr);

// let newArr = arr.filter(num => num % 3 === 0);

// console.log(newArr);



//------------------------------------------------------------------------------------------------------------

// Завдання 7

/*
    Дано початковий масив "arr", що містить числа.
  
    Створіть новий масив "newArr", який містить логічні значення: true — якщо значення 1, і false — якщо значення 0
*/

// let arr = [1, 0, 1, 0, 0, 1, 1, 1, 0, 0, 0, 1];

// let newArr = arr.map(value => value === 1);

// console.log(newArr);


//------------------------------------------------------------------------------------------------------------

// Завдання 8

/*
    Створіть змінні "start" та "end", змінні містять числа — початок і кінець діапазону
    
    Створіть порожній масив "arr"

    Заповніть масив значеннями в діапазоні від "start" до "end"

    Змінна "start" повинна бути меншою за "end"
*/

// let start = 1;
// let end = 10;

// let arr = [];

// for (let index = start; index <= end; index++) {
//     arr.push(index);
// }

// console.log(arr);
//------------------------------------------------------------------------------------------------------------

// Завдання 9

/*
    Дано початковий масив "arr", що містить числа.

    Створіть змінну "n", яка зберігає число більше 0

    Створіть новий масив "newArr", який містить перші n елементів початкового масиву
*/

// let arr = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];

// let n = 5;

// let newArr = arr.slice(0, n);

// console.log(newArr);



//------------------------------------------------------------------------------------------------------------

// Завдання 10

/*
    Дано початковий масив "arr", що містить числа.

    Створіть змінну "n", яка зберігає число більше 0

    Створіть новий масив "newArr", який містить останні n елементів початкового масиву
*/

// let arr = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];

// let n = 5;

// let newArr = arr.slice(n, 10);

// console.log(newArr);


//------------------------------------------------------------------------------------------------------------

// Завдання 11*

/*
    Дано початковий масив "arr", що містить числа.

    Створіть змінну "n", яка зберігає число 
    Створіть змінну "k", яка зберігає число 
  
    Створіть новий масив "newArr", який містить елементи початкового масиву з певної позиції "n" до певної позиції "k"


    Якщо n менше 0 — присвоїти початкове значення 0
    Якщо k більше або дорівнює довжині масиву — присвоїти початкове значення: довжина масиву -1
*/

// let arr = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];

// let n = 2;
// let k = 8;

// let newArr = arr.slice(n, k);

// console.log(newArr);



//------------------------------------------------------------------------------------------------------------

// Завдання 12

/*
    Дано початковий масив "arr", що містить числа.

    Створіть змінну "n", яка зберігає число більше 0
  
    Створіть новий масив "newArr", який містить останні n елементів початкового масиву
*/

// let arr = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];

//  #10



//------------------------------------------------------------------------------------------------------------

// Завдання 13*


/*
    Дано початковий масив "arr", що містить числа.

    Створіть масив "sumRows", у якому кожен елемент буде зберігати суму елементів відповідного рядка з масиву "arr".

    Виведіть у консоль масив "sumRows".

    Приклад:
    Початковий масив:
    const arr = [
        [  1,  2,  3,  4,  5 ],
        [  6,  7,  8,  9, 10 ],
        [ 11, 12, 13, 14, 15 ],
        [ 16, 17, 18, 19, 20 ],
        [ 21, 22, 23, 24, 25 ]
    ];

    "sumRows" — масив [0, 0, 0, 0, 0] 

    Результуючий масив sumRows:
    [15, 40, 65, 90, 115]
*/



// const arr = [
//     [  1,  2,  3,  4,  5 ],
//     [  6,  7,  8,  9, 10 ],
//     [ 11, 12, 13, 14, 15 ],
//     [ 16, 17, 18, 19, 20 ],
//     [ 21, 22, 23, 24, 25 ]
// ];

// let sumRows = [];

// for (let i = 0; i < arr.length; i++) {
//     let sum = 0;

//     for (let j = 0; j < arr[i].length; j++) {
//     sum += arr[i][j];
//     }
//     sumRows.push(sum);
// }


// console.log(sumRows);


//------------------------------------------------------------------------------------------------------------

// Завдання 14



/*
    Дано початковий масив "arr", що містить числа.

    Створіть масив "sumColumns", у якому кожен елемент буде зберігати суму елементів відповідного стовпця з масиву "arr".

    Виведіть у консоль масив "sumColumns".


    const arr = [
        [  1,  2,  3,  4,  5 ],
        [  6,  7,  8,  9, 10 ],
        [ 11, 12, 13, 14, 15 ],
        [ 16, 17, 18, 19, 20 ],
        [ 21, 22, 23, 24, 25 ]
    ];

    "sumColumns" — масив [0, 0, 0, 0, 0] 

    Результуючий масив sumColumns:
    [55, 60, 65, 70, 75]
*/


// const arr = [
//     [ 1,  2,  3,  4,  5 ],
//     [ 6,  7,  8,  9, 10 ],
//     [11, 12, 13, 14, 15 ],
//     [16, 17, 18, 19, 20 ],
//     [21, 22, 23, 24, 25 ]
// ];

// let sumColumns = [];

// for (let j = 0; j < arr[0].length; j++) {
//     sumColumns[j] = 0;
// }

// for (let i = 0; i < arr.length; i++) {
//     for (let j = 0; j < arr[i].length; j++) {
//         sumColumns[j] += arr[i][j];
//     }
// }

// console.log(sumColumns);


//------------------------------------------------------------------------------------------------------------
//------------------------------------------------------------------------------------------------------------

// part_2

// РЯДКИ

//------------------------------------------------------------------------------------------------------------

// Завдання 1

/*
  Створіть змінну "str", яка містить рядок "hello world the world".

  Створіть новий рядок "newStr", у якому кожне слово з початкового рядка починається з великої літери.
*/

let str = "hello world the world";

//------------------------------------------------------------------------------------------------------------

// Завдання 2

/*
  Створіть змінну "str", яка містить рядок "hello world the world".

  Створіть новий рядок "newStr", у якому кожне слово з початкового рядка закінчується великою літерою.
*/

//------------------------------------------------------------------------------------------------------------

// Завдання 3

/*
  Створіть змінну "str", яка містить рядок "hello world the world".

  Створіть новий рядок "newStr", у якому кожне слово з початкового рядка починається і закінчується великою літерою.
*/


//------------------------------------------------------------------------------------------------------------

// Завдання 4

/*
  Створіть змінну "str", яка містить рядок "hello world the world".

  Створіть новий рядок "newStr", у якому кожне слово з початкового рядка починається і закінчується великою літерою,
  окрім останнього слова, яке починається з великої літери.
*/

//------------------------------------------------------------------------------------------------------------


// Завдання 5

/*
  Створіть змінну "str", яка містить рядок "hello world the world".

  Створіть новий рядок "newStr", який містить початковий рядок у форматі "camelCase" 
*/


//------------------------------------------------------------------------------------------------------------


// Завдання 6

/*
  Створіть змінну "str", яка містить рядок "hello world the world".

  Створіть новий рядок "newStr", який містить абревіатуру початкового рядка. 
  В абревіатурі мають бути лише перші літери слів, довжина яких більша за 3 символи.
*/

//------------------------------------------------------------------------------------------------------------


// Завдання 7

/*
  Створіть змінну "str", яка містить рядок "hello world the world".

  Створіть новий рядок "newStr", у якому кожен парний символ кожного слова знаходиться у верхньому регістрі.
*/
//------------------------------------------------------------------------------------------------------------


// Завдання 8

/*
    Створіть змінну "str", яка містить рядок "hello world the world".

    Створіть новий рядок "newStr", у якому кожен НЕпарний символ кожного слова знаходиться у верхньому регістрі.
*/

//------------------------------------------------------------------------------------------------------------
//------------------------------------------------------------------------------------------------------------

// part_3

//------------------------------------------------------------------------------------------------------------
//------------------------------------------------------------------------------------------------------------


// const developers = [
//     // [id, name,    age, isCar,  [city, country],     typeDeveloper, level,    salary, skills[]                       ]
//     [ 1,    "Ivan",   25,  true,  ["Kyiv", "Ukraine"], "FrontEnd",    "Junior", 1200,   ["HTML", "CSS", "JavaScript" ] ],
//     [
//         2,
//         "Oleh",
//         25,
//         true,
//         ["Kyiv", "Ukraine"],
//         "FrontEnd",
//         "Junior",
//         1200,
//         ["HTML", "CSS", "JavaScript"]
//     ],
//     [
//         3,
//         "Sofia",
//         30,
//         false,
//         ["Kharkiv", "Ukraine"],
//         "FullStack",
//         "Senior",
//         3500,
//         ["HTML", "CSS", "JavaScript", "TypeScript", "Node.js", "Express", "SQL", "MySQL", "PostgreSQL", "MongoDB"]
//     ],
//     [
//         4,
//         "Danil",
//         22,
//         true,
//         ["Kharkiv", "Ukraine"],
//         "FrontEnd",
//         "Junior",
//         1700,
//         ["HTML", "CSS", "JavaScript", "TypeScript", "MUI"]
//     ],
//     [
//         5,
//         "Maxym",
//         28,
//         true,
//         ["Kharkiv", "Ukraine"],
//         "BackEnd",
//         "Junior",
//         1700,
//         ["JavaScript", "Node.js", "Express", "SQL", "MySQL", "MongoDB"]
//     ],
//     [
//         6,
//         "Andrey",
//         35,
//         false,
//         ["Kharkiv", "Ukraine"],
//         "DevOps",
//         "Junior",
//         1700,
//         ["Docker", "Kubernets", "CI/CD"]
//     ],
//     [
//         7,
//         "Anna",
//         29,
//         false,
//         ["Lviv", "Ukraine"],
//         "FrontEnd",
//         "Junior",
//         1500,
//         ["HTML", "CSS", "JavaScript", "TypeScript"]
//     ],
//     [
//         8,
//         "Artem",
//         26,
//         true,
//         ["Kyiv", "Ukraine"],
//         "FullStack",
//         "Middle",
//         3500,
//         ["HTML", "CSS", "JavaScript", "TypeScript", "MUI", "Node.js", "Express", "SQL", "MySQL", "MongoDB"]
//     ],
//     [
//         9,
//         "Ivan",
//         24,
//         false,
//         ["Lviv", "Ukraine"],
//         "DevOps",
//         "Junior",
//         1700,
//         ["HTML", "CSS", "JavaScript"]
//     ],
//     [
//         10,
//         "Igor",
//         27,
//         true,
//         ["Kharkiv", "Ukraine"],
//         "FrontEnd",
//         "Junior",
//         1200,
//         ["HTML", "CSS", "JavaScript"]
//     ],
//     [
//         11,
//         "Iryna",
//         33,
//         true,
//         ["Kharkiv", "Ukraine"],
//         "FullStack",
//         "Middle",
//         2700,
//         ["JavaScript", "TypeScript", "Node.js", "Express", "SQL", "MySQL", "MongoDB"]
//     ],
//     [
//         12,
//         "David",
//         31,
//         true,
//         ["Odessa", "Ukraine"],
//         "FullStack",
//         "Middle",
//         2200,
//         ["JavaScript", "Node.js", "Express", "SQL", "PostgreSQL", "MongoDB"]
//     ],
//     [
//         13,
//         "Andrey",
//         23,
//         false,
//         ["Kharkiv", "Ukraine"],
//         "DataBase",
//         "Senior",
//         4000,
//         ["SQL", "MySQL", "PostgreSQL", "MongoDB", "Redis"]
//     ],
//     [
//         14,
//         "Sofia",
//         30,
//         true,
//         ["Lviv", "Ukraine"],
//         "BackEnd",
//         "Middle",
//         2500,
//         ["JavaScript", "TypeScript", "Node.js", "Express", "SQL", "PostgreSQL", "MongoDB"]
//     ],
//     [
//         15,
//         "Roman",
//         29,
//         true,
//         ["Kharkiv", "Ukraine"],
//         "FullStack",
//         "Senior",
//         3800,
//         ["HTML", "CSS", "JavaScript", "TypeScript", "NestJS", "SQL", "MySQL", "PostgreSQL", "MongoDB", "TypeORM", "Sequelize"]
//     ],
//     [
//         16,
//         "Mykola",
//         28,
//         false,
//         ["Kharkiv", "Ukraine"],
//         "BackEnd",
//         "Senior",
//         3200,
//         ["JavaScript", "TypeScript", "Node.js", "Express", "SQL", "MySQL", "PostgreSQL", "MongoDB"]
//     ],
//     [
//         17,
//         "Kateryna",
//         26,
//         false,
//         ["Odessa", "Ukraine"],
//         "FrontEnd",
//         "Middle",
//         2000,
//         ["HTML", "CSS", "JavaScript", "Typescript", "MUI"]
//     ],
//     [
//         18,
//         "Oksana",
//         27,
//         true,
//         ["Kyiv", "Ukraine"],
//         "DataBase",
//         "Middle",
//         2500,
//         ["SQL", "MySQL", "MongoDB",]
//     ],
//     [
//         19,
//         "Anastasia",
//         25,
//         false,
//         ["Kharkiv", "Ukraine"],
//         "DevOps",
//         "Junior",
//         3800,
//         ["Docker", "CI/CD"]
//     ],
//     [
//         20,
//         "Mykola",
//         22,
//         true,
//         ["Kharkiv", "Ukraine"],
//         "FrontEnd",
//         "Senior",
//         3500,
//         ["HTML", "CSS", "JavaScript", "TypeSctipt"]
//     ],
//     [
//         21,
//         "Olena",
//         24,
//         true,
//         ["Kyiv", "Ukraine"],
//         "FrontEnd",
//         "Junior",
//         1700,
//         ["HTML", "CSS", "JavaScript", "TypeScript", "MUI"]
//     ],
// 
// ]

/*
    Масив "developers" містить вкладені масиви, де кожен елемент описує структуру "developer"

    [id, name, age, isCar, [city, country],     typeDeveloper, level,    salary, skills[]]

    - 0 id - число, ідентифікатор розробника
    - 1 name - рядок, ім’я розробника
    - 2 age - число, вік розробника
    - 3 isCar - буліан, є чи немає автомобіля у розробника
    - 4 address - вкладений масив рядків, місто ("city") та країна ("country") проживання розробника
    - 5 typeDeveloper - тип розробника - "FrontEnd", "BackEnd", "FullStack", "DataBase", "DevOps" 
    - 6 level - рядок, рівень розробника - "Junior", "Middle", "Senior", 
    - 7 salary - число, зарплата розробника
    - 8 skills - масив рядків, навички розробника

*/ 

//------------------------------------------------------------------------------------------------------------

// Завдання 1

/*
    Дано масив "developers", що містить масиви з інформацією про розробників.

    Створіть новий масив "newArr", який буде містити лише ті масиви, де вік розробників більший за 24.
*/

//------------------------------------------------------------------------------------------------------------

// Завдання 2

/*
    Дано масив "developers", що містить масиви з інформацією про розробників.

    Створіть новий масив "newArr", який буде містити лише ті масиви, де вік розробників менший за 24.

*/

//------------------------------------------------------------------------------------------------------------

// Завдання 3

/*
    Дано масив "developers", що містить масиви з інформацією про розробників.

    Створіть новий масив "newArr", який буде містити лише ті масиви, де вік розробників більший за 20 і менший за 25.

*/

//------------------------------------------------------------------------------------------------------------

// Завдання 4

/*
    Дано масив "developers", що містить масиви з інформацією про розробників.

    Створіть новий масив "newArr", який буде містити лише ті масиви, де вік розробників менший за 20 і більший за 25.

*/


//------------------------------------------------------------------------------------------------------------

// Завдання 5

/*
    Дано масив "developers", що містить масиви з інформацією про розробників.

    Створіть новий масив "newArr", який буде містити лише ті масиви, де зарплата (salary) розробників більша за 2500
*/


//------------------------------------------------------------------------------------------------------------

// Завдання 6

/*
    Дано масив "developers", що містить масиви з інформацією про розробників.

    Створіть новий масив "newArr", який буде містити лише ті масиви, де зарплата (salary) розробників менша за 2500
*/


//------------------------------------------------------------------------------------------------------------

// Завдання 7

/*
    Дано масив "developers", що містить масиви з інформацією про розробників.

    Створіть новий масив "newArr", який буде містити лише ті масиви, де зарплата (salary) розробників більша за 2000 і менша за 3000
*/



//------------------------------------------------------------------------------------------------------------

// Завдання 8

/*
    Дано масив "developers", що містить масиви з інформацією про розробників.

    Створіть новий масив "newArr", який буде містити лише ті масиви, у яких є автомобіль (isCar)
*/

//------------------------------------------------------------------------------------------------------------

// Завдання 9

/*
    Дано масив "developers", що містить масиви з інформацією про розробників.

    Створіть новий масив "newArr", який буде містити лише ті масиви, у яких немає автомобіля (isCar)
*/

//------------------------------------------------------------------------------------------------------------

// Завдання 10

/*
    Дано масив "developers", що містить масиви з інформацією про розробників.

    Створіть новий масив "newArr", який буде містити лише ті масиви, де посада розробника (typeDeveloper) — "frontend"
*/

//------------------------------------------------------------------------------------------------------------

// Завдання 11

/*
    Дано масив "developers", що містить масиви з інформацією про розробників.

    Створіть новий масив "newArr", який буде містити лише ті масиви, де посада розробника (typeDeveloper) — "fullstack"
*/

//------------------------------------------------------------------------------------------------------------

// Завдання 12

/*
    Дано масив "developers", що містить масиви з інформацією про розробників.

    Створіть новий масив "newArr", який буде містити лише ті масиви, де посада розробника (typeDeveloper) — "database" АБО "devops"
*/

//------------------------------------------------------------------------------------------------------------

// Завдання 13

/*
    Дано масив "developers", що містить масиви з інформацією про розробників.

    Створіть новий масив "newArr", який буде містити лише ті масиви, де рівень розробника (level) — "junior" АБО "senior"
*/

//------------------------------------------------------------------------------------------------------------

// Завдання 14

/*
    Дано масив "developers", що містить масиви з інформацією про розробників.

    Створіть новий масив "newArr", який буде містити лише ті масиви, які володіють навичками (skills) — "JavaScript" АБО "TypeScript"
*/

//------------------------------------------------------------------------------------------------------------

// Завдання 15***

/*
    Дано масив "developers", що містить масиви з інформацією про розробників.

    Створіть новий масив "newArr", який буде містити лише ті масиви, які володіють навичками (skills) — "JavaScript" І "TypeScript"
*/


//------------------------------------------------------------------------------------------------------------

// Завдання 16

/*
    Дано масив "developers", що містить масиви з інформацією про розробників.

    Створіть новий масив "newArr", який буде містити елементи,
    що являють собою підмасиви з такою структурою - [id, name, age, typeDeveloper, level, salary].
*/


//------------------------------------------------------------------------------------------------------------

// Завдання 17

/*
    Дано масив "developers", що містить масиви з інформацією про розробників.

    Створіть новий масив "newArr", який буде містити лише ті масиви, де адреса (місто) розробника — "Kharkiv".
*/

//------------------------------------------------------------------------------------------------------------

// Завдання 18**

/*
    Дано масив "developers", що містить масиви з інформацією про розробників.

    Створіть змінну "offset" — число, що вказує зміщення, з якої позиції повертати частину масиву.
    Створіть змінну "limit" — число, що вказує кількість елементів, які мають бути в новому масиві.

    Створіть новий масив "newArr", який буде містити елементи з масиву "developers",
    починаючи з позиції "offset" і в кількості "limit".

*/

//------------------------------------------------------------------------------------------------------------
//------------------------------------------------------------------------------------------------------------

