// part 1
//------------------------------------------------------------------------------------------------------------

// Завдання 1

/*
    Дано початковий масив "arr", що містить числа.
  
    Створіть новий масив "newArr", який містить елементи початкового масиву, помножені на 2

    Результат:
    console.log(newArr); // [2, 4, 6, 8, 10, 12, 14, 16, 18, 20]
*/

// let arr = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];

// let newArr = [];
// console.log(newArr);

// for (let index = 0; index < arr.length; index++){
//     const item = arr[index];

//     newArr[index] = item * 2;
// }

// console.log(newArr);
//------------------------------------------------------------------------------------------------------------

// Завдання 2

/*
    Створіть порожній масив "arr"

    Використовуючи методи масивів, додайте в масив значення в діапазоні від 1 до 10
    Виведіть у консоль отриманий масив
*/

// let arr = [];

// for (let index = 1; index <= 10; index++) {
//     arr.push(index);
// }

// console.log(arr);


//------------------------------------------------------------------------------------------------------------

// Завдання 3

/*
    Створіть порожній масив "arr"

    Використовуючи методи масивів, додайте в масив парні значення в діапазоні від 1 до 10
    Виведіть у консоль отриманий масив
*/

// let arr = [];

// for (let i = 1; i <= 10; i++) {
//     if (i % 2 === 0) {
//         arr.push(i);
//     }
// }

// console.log(arr);




//------------------------------------------------------------------------------------------------------------

// Завдання 4

/*
    Створіть порожній масив "arr"

    Використовуючи методи масивів, додайте в масив НЕпарні значення в діапазоні від 1 до 10
    Виведіть у консоль отриманий масив
*/

// let arr = [];

// for (let i = 1; i <= 10; i++) {
//     if (i % 2 !== 0) {
//         arr.push(i);
//     }
// }

// console.log(arr);

//------------------------------------------------------------------------------------------------------------

// Завдання 5

/*
    Дано початковий масив "arr", що містить числа.

    Створіть новий масив "newArr", який містить парні елементи початкового масиву
*/

// let arr = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];
// console.log(arr)

// let newArr = arr.filter(num => num % 2 === 0);

// console.log(newArr);





//------------------------------------------------------------------------------------------------------------

// Завдання 5

/*
    Дано початковий масив "arr", що містить числа.
  
    Створіть новий масив "newArr", який містить НЕпарні елементи початкового масиву
*/

// let arr = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];
// console.log(arr)

// let newArr = arr.filter(num => num % 2 !== 0);

// console.log(newArr);

//------------------------------------------------------------------------------------------------------------

// Завдання 6

/*
    Дано початковий масив "arr", що містить числа.
  
    Створіть новий масив "newArr", який містить елементи початкового масиву, кратні 3 (ділення на 3 без остачі)
*/

// let arr = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];
// console.log(arr);

// let newArr = arr.filter(num => num % 3 === 0);

// console.log(newArr);



//------------------------------------------------------------------------------------------------------------

// Завдання 7

/*
    Дано початковий масив "arr", що містить числа.
  
    Створіть новий масив "newArr", який містить логічні значення: true — якщо значення 1, і false — якщо значення 0
*/

// let arr = [1, 0, 1, 0, 0, 1, 1, 1, 0, 0, 0, 1];

// let newArr = arr.map(value => value === 1);

// console.log(newArr);


//------------------------------------------------------------------------------------------------------------

// Завдання 8

/*
    Створіть змінні "start" та "end", змінні містять числа — початок і кінець діапазону
    
    Створіть порожній масив "arr"

    Заповніть масив значеннями в діапазоні від "start" до "end"

    Змінна "start" повинна бути меншою за "end"
*/

// let start = 1;
// let end = 10;

// let arr = [];

// for (let index = start; index <= end; index++) {
//     arr.push(index);
// }

// console.log(arr);
//------------------------------------------------------------------------------------------------------------

// Завдання 9

/*
    Дано початковий масив "arr", що містить числа.

    Створіть змінну "n", яка зберігає число більше 0

    Створіть новий масив "newArr", який містить перші n елементів початкового масиву
*/

// let arr = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];

// let n = 5;

// let newArr = arr.slice(0, n);

// console.log(newArr);



//------------------------------------------------------------------------------------------------------------

// Завдання 10

/*
    Дано початковий масив "arr", що містить числа.

    Створіть змінну "n", яка зберігає число більше 0

    Створіть новий масив "newArr", який містить останні n елементів початкового масиву
*/

// let arr = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];

// let n = 5;

// let newArr = arr.slice(n, 10);

// console.log(newArr);


//------------------------------------------------------------------------------------------------------------

// Завдання 11*

/*
    Дано початковий масив "arr", що містить числа.

    Створіть змінну "n", яка зберігає число 
    Створіть змінну "k", яка зберігає число 
  
    Створіть новий масив "newArr", який містить елементи початкового масиву з певної позиції "n" до певної позиції "k"


    Якщо n менше 0 — присвоїти початкове значення 0
    Якщо k більше або дорівнює довжині масиву — присвоїти початкове значення: довжина масиву -1
*/

// let arr = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];

// let n = 2;
// let k = 8;

// let newArr = arr.slice(n, k);

// console.log(newArr);



//------------------------------------------------------------------------------------------------------------

// Завдання 12

/*
    Дано початковий масив "arr", що містить числа.

    Створіть змінну "n", яка зберігає число більше 0
  
    Створіть новий масив "newArr", який містить останні n елементів початкового масиву
*/

// let arr = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];

//  #10



//------------------------------------------------------------------------------------------------------------

// Завдання 13*


/*
    Дано початковий масив "arr", що містить числа.

    Створіть масив "sumRows", у якому кожен елемент буде зберігати суму елементів відповідного рядка з масиву "arr".

    Виведіть у консоль масив "sumRows".

    Приклад:
    Початковий масив:
    const arr = [
        [  1,  2,  3,  4,  5 ],
        [  6,  7,  8,  9, 10 ],
        [ 11, 12, 13, 14, 15 ],
        [ 16, 17, 18, 19, 20 ],
        [ 21, 22, 23, 24, 25 ]
    ];

    "sumRows" — масив [0, 0, 0, 0, 0] 

    Результуючий масив sumRows:
    [15, 40, 65, 90, 115]
*/



// const arr = [
//     [  1,  2,  3,  4,  5 ],
//     [  6,  7,  8,  9, 10 ],
//     [ 11, 12, 13, 14, 15 ],
//     [ 16, 17, 18, 19, 20 ],
//     [ 21, 22, 23, 24, 25 ]
// ];

// let sumRows = [];

// for (let i = 0; i < arr.length; i++) {
//     let sum = 0;

//     for (let j = 0; j < arr[i].length; j++) {
//     sum += arr[i][j];
//     }
//     sumRows.push(sum);
// }


// console.log(sumRows);


//------------------------------------------------------------------------------------------------------------

// Завдання 14



/*
    Дано початковий масив "arr", що містить числа.

    Створіть масив "sumColumns", у якому кожен елемент буде зберігати суму елементів відповідного стовпця з масиву "arr".

    Виведіть у консоль масив "sumColumns".


    const arr = [
        [  1,  2,  3,  4,  5 ],
        [  6,  7,  8,  9, 10 ],
        [ 11, 12, 13, 14, 15 ],
        [ 16, 17, 18, 19, 20 ],
        [ 21, 22, 23, 24, 25 ]
    ];

    "sumColumns" — масив [0, 0, 0, 0, 0] 

    Результуючий масив sumColumns:
    [55, 60, 65, 70, 75]
*/


// const arr = [
//     [ 1,  2,  3,  4,  5 ],
//     [ 6,  7,  8,  9, 10 ],
//     [11, 12, 13, 14, 15 ],
//     [16, 17, 18, 19, 20 ],
//     [21, 22, 23, 24, 25 ]
// ];

// let sumColumns = [];

// for (let j = 0; j < arr[0].length; j++) {
//     sumColumns[j] = 0;
// }

// for (let i = 0; i < arr.length; i++) {
//     for (let j = 0; j < arr[i].length; j++) {
//         sumColumns[j] += arr[i][j];
//     }
// }

// console.log(sumColumns);


//------------------------------------------------------------------------------------------------------------
//------------------------------------------------------------------------------------------------------------
